// const popup = new mapboxgl.Popup({ offset: 25 }).setText(
//     'Главный учебный корпус'
//     );

// // create DOM element for the marker
// const el = document.createElement('div');
// el.id = 'marker';

// const marker = new mapboxgl.Marker(el);
// marker.setLngLat([30.37291329462266, 60.00729726351207]);
// marker.setPopup(popup);
// marker.addTo(map);

const buildings = [[30.371637708055452, 60.009442067662775], [30.37971046131034, 60.004502189403105], 
[30.381513395591234, 60.00584438248049], [30.383585744074015, 60.00659839952964], [30.37420655321943, 60.005795561643815],
[30.37309273228797, 60.00756957947792], [30.376525394245935, 60.00821081176356], [30.37922882779944, 60.00811547350901],
[30.37993774294674, 60.00757438440383], [30.37958117370169, 60.00670508359577], [30.380950698031185, 60.0087545160023], 
[30.3764363460819, 60.00668077310731], [30.372909153905763, 60.00883776839012], [30.374962198950733, 60.00883399172451], 
[30.38155999525153, 60.007251346382134], [30.376829299492503, 60.00727915194905], [30.374831650473052, 59.99971333849637], 
[30.367472996646278, 60.000032389815324], [30.36641045090491, 60.00084158640833], [30.369665410685187, 60.00064034558925], 
[30.377574068179445, 60.009105787514834], [30.390376074217645, 60.00721626032794], [30.38982406674816, 60.00799910429373],
[30.34694495227213, 59.98644755007732], [30.357967602890373, 59.994775627122166], [30.35338503841055, 59.995100700688376], 
[30.369940666818806, 60.004948952985565], [30.37806204176902, 60.00498025990183], [30.373318328960874, 59.99872717049978], 
[30.37746953526298, 60.00977831160423], [30.374413897627626, 60.002872906990014], [30.370233243398474, 60.00537412533926], 
[30.369069639971624, 60.002772497502285], [30.387323998359108, 60.00936374654369], [30.373678978452226, 60.00060568009588]];

const dormitory = [[30.375810922465945, 59.99885141409969], [30.37471612491966, 59.99848812255121],
[30.373329968263477, 59.99858842067787], [30.374296771805174, 59.99893104032932], [30.374918542344098, 59.999700187137186], 
[30.37210616310716, 59.99945343526225], [30.37032337926519, 59.99871486136279], [30.342296552852662, 59.9861332933988], 
[30.343162383507675, 59.986675293116576], [30.345524736080208, 59.986667109340715], [30.345710601551797, 59.98624789566746], 
[30.34652839798614, 59.98618355921747], [30.34752418223296, 59.986321439846684], [30.348300358630073, 59.98633357411573], 
[30.342540694236924, 59.986687604980624], [30.344878715089123, 59.985612664085], [30.39209666876117, 60.00883360437638], 
[30.390299803324258, 60.00731214871138], [30.39117390201015, 60.01008988799963], [30.39078780599403, 60.01017761020717], 
[30.390408412976594, 60.0102281639758], [30.389951264625775, 60.01031796525518]];

const b_name = ['Приёмная комиссия (Бюро пропусков) Admission office (ID office)', 'Дом учёных Scientist’s club', 
'Гидротехнический корпус 1 Hydro academic building 1', 'Гидротехнический корпус 2 Hydro academic building 2', 
'Гидробашня Water supply tower', 'Главный учебный корпус Main academic building', 
'Механический корпус Mechanics academic building', 'Механические мастерские Mechanical workshop', 
'Лабораторно-аудиторный корпус Training and laboratory rooms building', 'Научно-исследовательский корпус Research & Development Centre', 
'Учебно-производственный корпус Industrial practice building', 'Химический корпус Chemistry academic building', 
'Учебный корпус No 1 Academic building No 1', 'Учебный корпус No 2 Academic building No 2', 
'Учебный корпус No 3 Academic building No 3', 'Учебный корпус No 4 Academic building No 4', 
'Учебный корпус No 5 Academic building No 5', 'Учебный корпус No 6 Academic building No 6', 
'Учебный корпус No 9 Academic building No 9', 'Учебный корпус No 10 Academic building No 10', 
'Учебный корпус No 11 Academic building No 11', 'Учебный корпус No 15 Academic building No 15', 
'Учебный корпус No 16 Academic building No 16', 'Студенческий клуб Student’s Club', 
'Учебный корпус Новороссийская ул. 50 Academic building Novorossiyskaya ul. 50', 
'Учебный корпус Новороссийская ул. 48 Academic building Novorossiyskaya ul. 48', 
'1-й профессорский корпус Professor’s building 1', '2-й профессорский корпус Professor’s building 2', 
'Управление студенческого городка Campus Administration', 'Управление социально-бытового и материально-технического обеспечения Procurement Office', 
'Научно-образовательный центр РАН Science and education center of RAS', 'Управление охраны труда Labour safety office', 
'Спорткомплекс «Политехник» Sports facilities “Polytechnic”', 'Корпус ТВН TVN building', 'Центр лазерных технологий Laser Technology Center'];

const d_name = ['Общежитие No 12', 'Общежитие No 14а', 'Общежитие No 14б', 'Общежитие No 14ц', 'Общежитие No 14п (Профилакторий)', 
'Общежитие No 8', 'Общежитие No 10', 'Общежитие No 1', 'Общежитие No 3', 'Общежитие No 4а', 'Общежитие No 4', 'Общежитие No 5а', 
'Общежитие No 5б', 'Общежитие No 6ф', 'Общежитие No 7 (для аспирантов)', 'Общежитие No 11', 'Общежитие No 13', 
'Общежитие No 15', 'Общежитие модуль A', 'Общежитие модуль B', 'Общежитие модуль C', 'Общежитие модуль D'];

for (let i = 0; i < buildings.length - 1; i++) {
    const marker = new mapboxgl.Marker();
    marker.setLngLat(buildings[i]);
    const popup = new mapboxgl.Popup({ offset: 25 }).setText(b_name[i]);
    marker.setPopup(popup);
    marker.addTo(map);
 }

 for (let i = 0; i < dormitory.length - 1; i++) {
    const marker = new mapboxgl.Marker({color: "#FF8000"});
    marker.setLngLat(dormitory[i]);
    const popup = new mapboxgl.Popup({ offset: 25 }).setText(d_name[i]);
    marker.setPopup(popup);
    marker.addTo(map);
 }