const buildings = [[30.371637708055452, 60.009442067662775], [30.37971046131034, 60.004502189403105],
[30.381513395591234, 60.00584438248049], [30.383585744074015, 60.00659839952964], [30.37420655321943, 60.005795561643815],
[30.37309273228797, 60.00756957947792], [30.376525394245935, 60.00821081176356], [30.37922882779944, 60.00811547350901],
[30.37993774294674, 60.00757438440383], [30.37958117370169, 60.00670508359577], [30.380950698031185, 60.0087545160023],
[30.3764363460819, 60.00668077310731], [30.372909153905763, 60.00883776839012], [30.374962198950733, 60.00883399172451],
[30.38155999525153, 60.007251346382134], [30.376829299492503, 60.00727915194905], [30.374831650473052, 59.99971333849637],
[30.367472996646278, 60.000032389815324], [30.36641045090491, 60.00084158640833], [30.369665410685187, 60.00064034558925],
[30.377574068179445, 60.009105787514834], [30.390376074217645, 60.00721626032794], [30.38982406674816, 60.00799910429373],
[30.34694495227213, 59.98644755007732], [30.357967602890373, 59.994775627122166], [30.35338503841055, 59.995100700688376],
[30.369940666818806, 60.004948952985565], [30.37806204176902, 60.00498025990183], [30.373318328960874, 59.99872717049978],
[30.37746953526298, 60.00977831160423], [30.374413897627626, 60.002872906990014], [30.370233243398474, 60.00537412533926],
[30.369069639971624, 60.002772497502285], [30.387323998359108, 60.00936374654369], [30.373678978452226, 60.00060568009588]];

const dormitory = [[30.375810922465945, 59.99885141409969], [30.37471612491966, 59.99848812255121],
[30.373329968263477, 59.99858842067787], [30.374296771805174, 59.99893104032932], [30.374918542344098, 59.999700187137186],
[30.37210616310716, 59.99945343526225], [30.37032337926519, 59.99871486136279], [30.342296552852662, 59.9861332933988],
[30.343162383507675, 59.986675293116576], [30.345524736080208, 59.986667109340715], [30.345710601551797, 59.98624789566746],
[30.34652839798614, 59.98618355921747], [30.34752418223296, 59.986321439846684], [30.348300358630073, 59.98633357411573],
[30.342540694236924, 59.986687604980624], [30.344878715089123, 59.985612664085], [30.39209666876117, 60.00883360437638],
[30.390299803324258, 60.00731214871138], [30.39117390201015, 60.01008988799963], [30.39078780599403, 60.01017761020717],
[30.390408412976594, 60.0102281639758], [30.389951264625775, 60.01031796525518]];

const metro = [[30.344120, 59.984863], [30.366303, 59.999614], [30.370794, 60.008938], [30.396197, 60.012797]];

const b_name = ['Приёмная комиссия (Бюро пропусков)', 'Дом учёных',
    'Гидротехнический корпус 1', 'Гидротехнический корпус 2', 'Гидробашня', 'Главный учебный корпус',
    'Механический корпус', 'Механические мастерские', 'Лабораторно-аудиторный корпус', 'Научно-исследовательский корпус',
    'Учебно-производственный корпус', 'Химический корпус', 'Учебный корпус No 1', 'Учебный корпус No 2',
    'Учебный корпус No 3', 'Учебный корпус No 4', 'Учебный корпус No 5', 'Учебный корпус No 6',
    'Учебный корпус No 9', 'Учебный корпус No 10', 'Учебный корпус No 11', 'Учебный корпус No 15',
    'Учебный корпус No 16', 'Студенческий клуб', 'Учебный корпус Новороссийская ул. 50',
    'Учебный корпус Новороссийская ул. 48', '1-й профессорский корпус', '2-й профессорский корпус',
    'Управление студенческого городка', 'Управление социально-бытового и материально-технического обеспечения',
    'Научно-образовательный центр РАН', 'Управление охраны труда', 'Спорткомплекс «Политехник»”', 'Корпус ТВН', 'Центр лазерных технологий'];

const b_name_a = ['Admission office (ID office)', 'Scientist’s club',
    'Hydro academic building 1', 'Hydro academic building 2', 'Water supply tower', 'Main academic building',
    'Mechanics academic building', 'Mechanical workshop', 'Training and laboratory rooms building', 'Research & Development Centre',
    'Industrial practice building', 'Chemistry academic building', 'Academic building No 1', 'Academic building No 2',
    'Academic building No 3', 'Academic building No 4', 'Academic building No 5', 'Academic building No 6',
    'Academic building No 9', 'Academic building No 10', 'Academic building No 11', 'Academic building No 15',
    'Academic building No 16', 'Student’s Club', 'Academic building Novorossiyskaya ul. 50',
    'Academic building Novorossiyskaya ul. 48', 'Professor’s building 1', 'Professor’s building 2',
    'Campus Administration', 'Procurement Office', 'Science and education center of RAS', 'Labour safety office',
    'Sports facilities “Polytechnic”', 'TVN building', 'Laser Technology Center'];

const b_name_b = ['Бюро пропусков, Отдел аренды и парковок, Приемная комиссия', '-', 'Дирекция Инженерно-строительного института',
    '-', 'Фаблаб, Центр патриотического воспитания молодежи', 
    'Белый зал, Выставочный зал, Дирекция Института энергетики, Приемная комиссия, Приемная ректора, Фундаментальная библиотека, Центр по работе с выпускниками, Штаб студенческих отрядов', 
    '-', '-', '-', 'Архив университета, Дирекция Института передовых производственных технологий, Дирекция конгрессно-выставочной деятельности, Медиа-центр, Суперкомпьютерный центр, Центр открытого образования', 
    '-', '-', 'Военно-учетный стол, Дирекция Института дополнительного образования, Дирекция Института машиностроения, материалов и транспорта, Отдел координации работы с аспирантами, Отдел развития и карьеры, Профсоюзная организация сотрудников, Профсоюзная организация студентов и аспирантов, Управление бухгалтерского учета, Управление персонала, Учебный отдел', 
    'Дирекция Института прикладной математики и механики, Дирекция Института физики, нанотехнологий и телекоммуникаций, Издательско-полиграфический центр', 
    'Дирекция Института промышленного менеджмента, экономики и торговли', 'Издательско-полиграфический центр', 
    'Дирекция Института биомедицинский систем и биотехнологий', 'Дирекция Гуманитарного института', 
    'Дирекция Института компьютерных наук и технологий', '-', 'Факультет военного обучения', 'Дирекция Высшей школы международных образовательных программ, Концертный зал ВШМОП, Управление международного образования, Управление международного сотрудничества', 
    'Управление студенческого городка', 'Студенческий клуб', '-', '-', '-', 'Историко-технический музей, Центр безопасности университета', 
    '-', '-', '-', '-', 'Дирекция Института физической культуры, спорта и туризма', '-', '-'];

const d_name = ['Общежитие No 12', 'Общежитие No 14а', 'Общежитие No 14б', 'Общежитие No 14ц', 'Общежитие No 14п (Профилакторий)',
    'Общежитие No 8', 'Общежитие No 10', 'Общежитие No 1', 'Общежитие No 3', 'Общежитие No 4а', 'Общежитие No 4', 'Общежитие No 5а',
    'Общежитие No 5б', 'Общежитие No 6ф', 'Общежитие No 7 (для аспирантов)', 'Общежитие No 11', 'Общежитие No 13',
    'Общежитие No 15', 'Общежитие модуль A', 'Общежитие модуль B', 'Общежитие модуль C', 'Общежитие модуль D'];

const d_name_a = ['Dormitory No 12', 'Dormitory No 14а', 'Dormitory No 14b', 'Dormitory No 14c', 'Dormitory No 14p (Dispensary)',
    'Dormitory No 8', 'Dormitory No 10', 'Dormitory No 1', 'Dormitory No 3', 'Dormitory No 4a', 'Dormitory No 4', 'Dormitory No 5a',
    'Dormitory No 5b', 'Dormitory No 6f', 'Dormitory No 7 (for graduate students)', 'Dormitory No 11', 'Dormitory No 13',
    'Dormitory No 15', 'Dormitory module A', 'Dormitory module B', 'Dormitory module C', 'Dormitory module D'];

const m_name = ['Лесная', 'Площадь Мужества', 'Политехническая', 'Академическая'];

const m_name_a = ['Lesnaya', 'Ploschad Muzhestva', 'Polytechnicheskaya', 'Akademicheskaya'];

for (let i = 0; i < buildings.length; i++) {
    const popUps = document.getElementsByClassName('mapboxgl-popup');
    const markers = document.getElementsByClassName('mapboxgl-marker');
    const marker = new mapboxgl.Marker();
    marker.setLngLat(buildings[i]);
    const popup = new mapboxgl.Popup({ offset: 25 });
    if (b_name_b[i] == '-'){
        popup.setHTML(`<h1>${b_name[i]}</h1><h2>${b_name_a[i]}</h2>`);
    } else {
        popup.setHTML(`<h1>${b_name[i]}</h1><h2>${b_name_a[i]}</h2><h6>Подразделения СПбПУ:</h6><h3>${b_name_b[i]}</h3>`);
    }
    marker.setPopup(popup);
    marker.addTo(map);
}

for (let i = 0; i < dormitory.length; i++) {
    const popUps = document.getElementsByClassName('mapboxgl-popup');
    const markers = document.getElementsByClassName('mapboxgl-marker');
    const marker = new mapboxgl.Marker({ color: "#FF8000" });
    marker.setLngLat(dormitory[i]);
    const popup = new mapboxgl.Popup({ offset: 25 });
    popup.setHTML(`<h4>${d_name[i]}</h4><h5>${d_name_a[i]}</h5>`);
    marker.setPopup(popup);
    marker.addTo(map);
}

for (let i = 0; i < metro.length; i++) {
    const popUps = document.getElementsByClassName('mapboxgl-popup');
    const markers = document.getElementsByClassName('mapboxgl-marker');
    const marker = new mapboxgl.Marker({ color: "#FF0000" });
    marker.setLngLat(metro[i]);
    const popup = new mapboxgl.Popup({ offset: 25 });
    popup.setHTML(`<h4>${m_name[i]}</h4><h5>${m_name_a[i]}</h5>`);
    marker.setPopup(popup);
    marker.addTo(map);
}